/*
 * «Морской бой» — вывести на экран массив 10х10, состоящий из символов X и O,
 * где Х — элементы кораблей,
 * а О — свободные клетки.
 */

using System;

namespace Lesson_3.Task_4
{
    public class SeaBattle
    {
        public void Start()
        {
            var field = SetupShipsEasy();
            ShowField(field);
        }

        private string[,] SetupShipsEasy()
        {
            string[,] field =
            {
                { "·", "·", "·", "·", "·", "·", "·", "·", "■", "·" },
                { "·", "■", "■", "■", "■", "·", "·", "·", "·", "·" },
                { "·", "·", "·", "·", "·", "·", "■", "■", "·", "■" },
                { "■", "·", "·", "·", "·", "·", "·", "·", "·", "·" },
                { "·", "·", "·", "·", "·", "·", "·", "·", "·", "·" },
                { "·", "·", "·", "·", "■", "■", "■", "·", "■", "·" },
                { "·", "■", "·", "·", "·", "·", "·", "·", "■", "·" },
                { "·", "■", "·", "■", "·", "·", "·", "·", "■", "·" },
                { "·", "·", "·", "■", "·", "·", "■", "·", "·", "·" },
                { "·", "·", "·", "·", "·", "·", "·", "·", "·", "·" }
            };

            return field;
        }

        private void ShowField(string[,] field)
        {
            for (int i = 0; i < field.GetLength(0); i++)
            {
                for (int j = 0; j < field.GetLength(1); j++)
                {
                    Console.Write($" {field[i,j]}");
                }

                Console.WriteLine();
            }
        }

    }
}